X-Transcoder/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @user = User.find(params[:id])
    @x_coders = @user.x_coders.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "x_coders".* FROM "x_coders" WHERE "x_coders"."user_id" = 2 ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "x_coders" WHERE "x_coders"."user_id" = 7