X-Transcoder/app/views/users/show.html.erb

SELECT COUNT(*) FROM "x_coders" WHERE "x_coders"."user_id" = 7
---
  <div class="span8">
    <% if @user.x_coders.any? %>