X-Transcoder/app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "x_coders" WHERE "x_coders"."user_id" = 7
---
<span>
  <%= pluralize(current_user.x_coders.count, "x_transcoding task") %>